# -*- coding: utf-8 -*-
RED = "\033[1;31m"  
BLUE = "\033[1;34m"
CYAN = "\033[1;36m"
GREEN = "\033[1;32m"
YELLOW = "\33[1;93m"
NORMAL = "\033[0;0m"
BOLD = "\033[;1m"

def print_banner():
   logo = """
  _____ _          _   _      _   _  ___ _ _           
 |_   _| |__   ___| \ | | ___| |_| |/ (_) | | ___ _ __ 
   | | | '_ \ / _ \  \| |/ _ \ __| ' /| | | |/ _ \ '__|
   | | | | | |  __/ |\  |  __/ |_| . \| | | |  __/ |   
   |_| |_| |_|\___|_| \_|\___|\__|_|\_\_|_|_|\___|_|   
   """
   print(logo)

def print_options():
   print("\n" \
         "[{R}1{N}]  მოწყობილობების სკანირება\n"\
         "{N}[{R}2{N}]  მოწყობილობების სკანირება (ვრცლად)\n" \
         "{N}[{R}3{N}]  გაყარე მოწყობილობები ქსელიდან (ARP-Spoof)\n" \
         "\nმიუთითე {R}'განმარტება'{N} რათა გაიგო ფუნქციების აღწერები.".format(Y=YELLOW, R=RED, N=NORMAL))

def print_help():
    print("""
  -> მოწყობილობების სკანირება
     ---------
     ეს ფუნქცია მოძებნის ქსლეში არსებულ მოწყობილობებს და მოგცემს ინფრომაციას მათზე 
     MAC-ს, IP-ს, Hostaname-ს და მოწყობილობის წარმომადგენელს.
     
  -> მოწყობილობების სკანირება (ხელით)
     ------------------
     ეს ფუნქცია მოძებნის ქსლეში არსებულ მოწყობილობებს და მოგცემს ინფრომაციას მათზე 
     MAC-ს, IP-ს, Hostaname-ს, მოწყობილობის წარმომადგენელს და ღია პორტებზე ინფორმაციას.

  -> გაყარე მოწყობილობები ქსელიდან (ARP-Spoof)
     ----------
     ეს ფუნქცია მოძებნის ქსელში არსებულ მოწყობილობებს და მოგცემს საშუალებას
     შეუზღუდო მათ ინტერნეტი იქამდე სანამ პროგრამა გაშვებული იქნება.\n""")

